---
kind: property
id: P:Autodesk.Revit.DB.MultiReferenceAnnotationType.GroupTagHeads
source: html/c8bbdb4c-9c69-b4b8-7382-c3d9f54f380c.htm
---
# Autodesk.Revit.DB.MultiReferenceAnnotationType.GroupTagHeads Property

Controls if parameter values for the annotation's references will be reported in one grouped tag head
 or if every reference will get its own tag head.

## Syntax (C#)
```csharp
public bool GroupTagHeads { get; set; }
```